<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"b6d7e1ce88c9c20b51bb9837cd748bcf88287d1dfc2f2fc4b024c3737552c15a","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1061 at https://github.com/cal-itp/data-infra/actions/runs/19555738870","plan_out_hash":"861f982761ba11e68e1963ad66877914c26f79207e12862e417f96026671e71f","plan_hash":"90caceabae920322c9d96d04e927d786e74c8bff181bac8d19d4ce9cf1e12fb6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "EgKYrQ==" -> (known after apply)
!~      detect_md5hash      = "zXCdMUTiP2SAKOxopKcrIQ==" -> "different hash"
!~      generation          = 1753225938260687 -> (known after apply)
        id                  = "calitp-composer-dags/download_gtfs_schedule_v2/METADATA.yml"
!~      md5hash             = "zXCdMUTiP2SAKOxopKcrIQ==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/_email_download_failures.py"] will be destroyed
  # (because key ["dags/download_gtfs_schedule_v2/_email_download_failures.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "W7LJjA==" -> null
-       detect_md5hash      = "iRJ0PWcukGt+i1vBoZ/mmg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1760041506297314 -> null
-       id                  = "calitp-composer-dags/download_gtfs_schedule_v2/_email_download_failures.py" -> null
-       md5hash             = "iRJ0PWcukGt+i1vBoZ/mmg==" -> null
-       md5hexhash          = "8912743d672e906b7e8b5bc1a19fe69a" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fdownload_gtfs_schedule_v2%2F_email_download_failures.py?generation=1760041506297314&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/download_gtfs_schedule_v2/_email_download_failures.py" -> null
-       output_name         = "dags/download_gtfs_schedule_v2/_email_download_failures.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fdownload_gtfs_schedule_v2%2F_email_download_failures.py" -> null
-       source              = "../../../../airflow/dags/download_gtfs_schedule_v2/_email_download_failures.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/email_download_failures.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/download_gtfs_schedule_v2/email_download_failures.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/download_gtfs_schedule_v2/email_download_failures.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ovFIJQ==" -> (known after apply)
!~      detect_md5hash      = "oGP0hu4fHuVPjtmkPK4quA==" -> "different hash"
!~      generation          = 1763589718376829 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "oGP0hu4fHuVPjtmkPK4quA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "yN0O3g==" -> (known after apply)
!~      detect_md5hash      = "/sHkOmA4JBu0D7LTdbFcAQ==" -> "different hash"
!~      generation          = 1763589719870074 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "/sHkOmA4JBu0D7LTdbFcAQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1061](https://github.com/cal-itp/data-infra/actions/runs/19555738870)